zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_0.h
/** Number of instances of the CPE_LLC_0 module. */
#define CPE_LLC_0_INSTANCE_COUNT                 (1u)

/* CPE_LLC_0 - Peripheral instance base addresses */
/** Peripheral CPE_LLC_0 base address */
#define IP_CPE_LLC_0_BASE                        (0x41010000u)
/** Peripheral CPE_LLC_0 base pointer */
#define IP_CPE_LLC_0                             ((CPE_LLC_0_Type *)IP_CPE_LLC_0_BASE)
/** Array initializer of CPE_LLC_0 peripheral base addresses */
#define IP_CPE_LLC_0_BASE_ADDRS                  { IP_CPE_LLC_0_BASE }
/** Array initializer of CPE_LLC_0 peripheral base pointers */
#define IP_CPE_LLC_0_BASE_PTRS                   { IP_CPE_LLC_0 }

/* ----------------------------------------------------------------------------
   -- CPE_LLC_0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_LLC_0_Register_Masks CPE_LLC_0 Register Masks
 * @{
 */

/*! @name CCUTCR - Transaction Control */
/*! @{ */

#define CPE_LLC_0_CCUTCR_TRANSEN_MASK            (0x1U)
#define CPE_LLC_0_CCUTCR_TRANSEN_SHIFT           (0U)
#define CPE_LLC_0_CCUTCR_TRANSEN_WIDTH           (1U)
#define CPE_LLC_0_CCUTCR_TRANSEN(x)              (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUTCR_TRANSEN_SHIFT)) & CPE_LLC_0_CCUTCR_TRANSEN_MASK)
/*! @} */

/*! @name CCUTAR - Transaction Activity */
/*! @{ */

#define CPE_LLC_0_CCUTAR_TRANSACTV_MASK          (0x1U)
#define CPE_LLC_0_CCUTAR_TRANSACTV_SHIFT         (0U)
#define CPE_LLC_0_CCUTAR_TRANSACTV_WIDTH         (1U)
#define CPE_LLC_0_CCUTAR_TRANSACTV(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUTAR_TRANSACTV_SHIFT)) & CPE_LLC_0_CCUTAR_TRANSACTV_MASK)
/*! @} */

/*! @name CCUCTCR - Cache Transaction Control */
/*! @{ */

#define CPE_LLC_0_CCUCTCR_LOOKUPEN_MASK          (0x1U)
#define CPE_LLC_0_CCUCTCR_LOOKUPEN_SHIFT         (0U)
#define CPE_LLC_0_CCUCTCR_LOOKUPEN_WIDTH         (1U)
#define CPE_LLC_0_CCUCTCR_LOOKUPEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCTCR_LOOKUPEN_SHIFT)) & CPE_LLC_0_CCUCTCR_LOOKUPEN_MASK)

#define CPE_LLC_0_CCUCTCR_FILLEN_MASK            (0x2U)
#define CPE_LLC_0_CCUCTCR_FILLEN_SHIFT           (1U)
#define CPE_LLC_0_CCUCTCR_FILLEN_WIDTH           (1U)
#define CPE_LLC_0_CCUCTCR_FILLEN(x)              (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCTCR_FILLEN_SHIFT)) & CPE_LLC_0_CCUCTCR_FILLEN_MASK)
/*! @} */

/*! @name CCUCTAR - Cache Transaction Activity */
/*! @{ */

#define CPE_LLC_0_CCUCTAR_EVICTACTV_MASK         (0x1U)
#define CPE_LLC_0_CCUCTAR_EVICTACTV_SHIFT        (0U)
#define CPE_LLC_0_CCUCTAR_EVICTACTV_WIDTH        (1U)
#define CPE_LLC_0_CCUCTAR_EVICTACTV(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCTAR_EVICTACTV_SHIFT)) & CPE_LLC_0_CCUCTAR_EVICTACTV_MASK)

#define CPE_LLC_0_CCUCTAR_FILLACTV_MASK          (0x2U)
#define CPE_LLC_0_CCUCTAR_FILLACTV_SHIFT         (1U)
#define CPE_LLC_0_CCUCTAR_FILLACTV_WIDTH         (1U)
#define CPE_LLC_0_CCUCTAR_FILLACTV(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCTAR_FILLACTV_SHIFT)) & CPE_LLC_0_CCUCTAR_FILLACTV_MASK)

#define CPE_LLC_0_CCUCTAR_FLUSHACTV_MASK         (0x4U)
#define CPE_LLC_0_CCUCTAR_FLUSHACTV_SHIFT        (2U)
#define CPE_LLC_0_CCUCTAR_FLUSHACTV_WIDTH        (1U)
#define CPE_LLC_0_CCUCTAR_FLUSHACTV(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCTAR_FLUSHACTV_SHIFT)) & CPE_LLC_0_CCUCTAR_FLUSHACTV_MASK)
/*! @} */

/*! @name CCUCAOR - Allocation Override */
/*! @{ */

#define CPE_LLC_0_CCUCAOR_AWALLOCEN_MASK         (0x1U)
#define CPE_LLC_0_CCUCAOR_AWALLOCEN_SHIFT        (0U)
#define CPE_LLC_0_CCUCAOR_AWALLOCEN_WIDTH        (1U)
#define CPE_LLC_0_CCUCAOR_AWALLOCEN(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCAOR_AWALLOCEN_SHIFT)) & CPE_LLC_0_CCUCAOR_AWALLOCEN_MASK)

#define CPE_LLC_0_CCUCAOR_ARALLOCEN_MASK         (0x2U)
#define CPE_LLC_0_CCUCAOR_ARALLOCEN_SHIFT        (1U)
#define CPE_LLC_0_CCUCAOR_ARALLOCEN_WIDTH        (1U)
#define CPE_LLC_0_CCUCAOR_ARALLOCEN(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCAOR_ARALLOCEN_SHIFT)) & CPE_LLC_0_CCUCAOR_ARALLOCEN_MASK)

#define CPE_LLC_0_CCUCAOR_WRALLOCPARTIALEN_MASK  (0x4U)
#define CPE_LLC_0_CCUCAOR_WRALLOCPARTIALEN_SHIFT (2U)
#define CPE_LLC_0_CCUCAOR_WRALLOCPARTIALEN_WIDTH (1U)
#define CPE_LLC_0_CCUCAOR_WRALLOCPARTIALEN(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCAOR_WRALLOCPARTIALEN_SHIFT)) & CPE_LLC_0_CCUCAOR_WRALLOCPARTIALEN_MASK)

#define CPE_LLC_0_CCUCAOR_AWALLOCVALUE_MASK      (0xF0000U)
#define CPE_LLC_0_CCUCAOR_AWALLOCVALUE_SHIFT     (16U)
#define CPE_LLC_0_CCUCAOR_AWALLOCVALUE_WIDTH     (4U)
#define CPE_LLC_0_CCUCAOR_AWALLOCVALUE(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCAOR_AWALLOCVALUE_SHIFT)) & CPE_LLC_0_CCUCAOR_AWALLOCVALUE_MASK)

#define CPE_LLC_0_CCUCAOR_ARALLOCVALUE_MASK      (0xF00000U)
#define CPE_LLC_0_CCUCAOR_ARALLOCVALUE_SHIFT     (20U)
#define CPE_LLC_0_CCUCAOR_ARALLOCVALUE_WIDTH     (4U)
#define CPE_LLC_0_CCUCAOR_ARALLOCVALUE(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCAOR_ARALLOCVALUE_SHIFT)) & CPE_LLC_0_CCUCAOR_ARALLOCVALUE_MASK)
/*! @} */

/*! @name CCUSPCR0 - Scratchpad Configuration 0 */
/*! @{ */

#define CPE_LLC_0_CCUSPCR0_SCPADEN_MASK          (0x1U)
#define CPE_LLC_0_CCUSPCR0_SCPADEN_SHIFT         (0U)
#define CPE_LLC_0_CCUSPCR0_SCPADEN_WIDTH         (1U)
#define CPE_LLC_0_CCUSPCR0_SCPADEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUSPCR0_SCPADEN_SHIFT)) & CPE_LLC_0_CCUSPCR0_SCPADEN_MASK)

#define CPE_LLC_0_CCUSPCR0_NUMSCPADWAYS_MASK     (0xF0000U)
#define CPE_LLC_0_CCUSPCR0_NUMSCPADWAYS_SHIFT    (16U)
#define CPE_LLC_0_CCUSPCR0_NUMSCPADWAYS_WIDTH    (4U)
#define CPE_LLC_0_CCUSPCR0_NUMSCPADWAYS(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUSPCR0_NUMSCPADWAYS_SHIFT)) & CPE_LLC_0_CCUSPCR0_NUMSCPADWAYS_MASK)
/*! @} */

/*! @name CCUSPCR1 - Scratchpad Configuration 1 */
/*! @{ */

#define CPE_LLC_0_CCUSPCR1_SCPADSIZE_MASK        (0xFFFFFFFFU)
#define CPE_LLC_0_CCUSPCR1_SCPADSIZE_SHIFT       (0U)
#define CPE_LLC_0_CCUSPCR1_SCPADSIZE_WIDTH       (32U)
#define CPE_LLC_0_CCUSPCR1_SCPADSIZE(x)          (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUSPCR1_SCPADSIZE_SHIFT)) & CPE_LLC_0_CCUSPCR1_SCPADSIZE_MASK)
/*! @} */

/*! @name CCUSPBR0 - Scratchpad Base Address 0 */
/*! @{ */

#define CPE_LLC_0_CCUSPBR0_SCPADBASEADDR_MASK    (0xFFFFFFFFU)
#define CPE_LLC_0_CCUSPBR0_SCPADBASEADDR_SHIFT   (0U)
#define CPE_LLC_0_CCUSPBR0_SCPADBASEADDR_WIDTH   (32U)
#define CPE_LLC_0_CCUSPBR0_SCPADBASEADDR(x)      (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUSPBR0_SCPADBASEADDR_SHIFT)) & CPE_LLC_0_CCUSPBR0_SCPADBASEADDR_MASK)
/*! @} */

/*! @name CCUWPCR00 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR00_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR00_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR00_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR00_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR00_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR00_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR00_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR00_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR00_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR00_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR00_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR00_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR10 - Way Partitioning Control */
/*! @{ */

