zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_0.h
#define CPE_LLC_0_CCUWPCR10_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR10_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR10_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR10_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR10_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR10_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR01 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR01_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR01_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR01_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR01_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR01_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR01_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR01_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR01_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR01_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR01_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR01_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR01_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR11 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR11_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR11_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR11_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR11_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR11_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR11_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR02 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR02_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR02_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR02_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR02_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR02_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR02_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR02_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR02_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR02_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR02_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR02_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR02_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR12 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR12_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR12_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR12_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR12_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR12_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR12_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR03 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR03_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR03_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR03_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR03_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR03_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR03_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR03_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR03_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR03_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR03_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR03_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR03_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR13 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR13_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR13_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR13_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR13_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR13_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR13_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR04 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR04_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR04_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR04_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR04_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR04_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR04_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR04_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR04_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR04_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR04_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR04_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR04_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR14 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR14_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR14_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR14_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR14_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR14_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR14_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR05 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR05_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR05_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR05_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR05_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR05_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR05_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR05_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR05_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR05_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR05_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR05_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR05_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR15 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR15_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR15_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR15_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR15_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR15_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR15_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR06 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR06_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR06_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR06_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR06_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR06_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR06_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR06_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR06_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR06_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR06_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR06_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR06_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR16 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR16_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR16_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR16_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR16_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR16_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR16_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR07 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR07_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_0_CCUWPCR07_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_0_CCUWPCR07_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_0_CCUWPCR07_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR07_WPAGENTID_SHIFT)) & CPE_LLC_0_CCUWPCR07_WPAGENTID_MASK)

#define CPE_LLC_0_CCUWPCR07_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_0_CCUWPCR07_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_0_CCUWPCR07_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_0_CCUWPCR07_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR07_WPAGENTIDVALID_SHIFT)) & CPE_LLC_0_CCUWPCR07_WPAGENTIDVALID_MASK)
/*! @} */

