zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_0.h
/*! @name CCUWPCR17 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_0_CCUWPCR17_WPWAYVECTOR_MASK     (0xFFFFU)
#define CPE_LLC_0_CCUWPCR17_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_0_CCUWPCR17_WPWAYVECTOR_WIDTH    (16U)
#define CPE_LLC_0_CCUWPCR17_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUWPCR17_WPWAYVECTOR_SHIFT)) & CPE_LLC_0_CCUWPCR17_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUCMCR - Maintenance Control */
/*! @{ */

#define CPE_LLC_0_CCUCMCR_MNTOP_MASK             (0xFU)
#define CPE_LLC_0_CCUCMCR_MNTOP_SHIFT            (0U)
#define CPE_LLC_0_CCUCMCR_MNTOP_WIDTH            (4U)
#define CPE_LLC_0_CCUCMCR_MNTOP(x)               (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMCR_MNTOP_SHIFT)) & CPE_LLC_0_CCUCMCR_MNTOP_MASK)

#define CPE_LLC_0_CCUCMCR_ARRAYID_MASK           (0x3F0000U)
#define CPE_LLC_0_CCUCMCR_ARRAYID_SHIFT          (16U)
#define CPE_LLC_0_CCUCMCR_ARRAYID_WIDTH          (6U)
#define CPE_LLC_0_CCUCMCR_ARRAYID(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMCR_ARRAYID_SHIFT)) & CPE_LLC_0_CCUCMCR_ARRAYID_MASK)

#define CPE_LLC_0_CCUCMCR_SECATTR_MASK           (0x400000U)
#define CPE_LLC_0_CCUCMCR_SECATTR_SHIFT          (22U)
#define CPE_LLC_0_CCUCMCR_SECATTR_WIDTH          (1U)
#define CPE_LLC_0_CCUCMCR_SECATTR(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMCR_SECATTR_SHIFT)) & CPE_LLC_0_CCUCMCR_SECATTR_MASK)
/*! @} */

/*! @name CCUCMAR - Maintenance Activity */
/*! @{ */

#define CPE_LLC_0_CCUCMAR_MNTOPACTV_MASK         (0x1U)
#define CPE_LLC_0_CCUCMAR_MNTOPACTV_SHIFT        (0U)
#define CPE_LLC_0_CCUCMAR_MNTOPACTV_WIDTH        (1U)
#define CPE_LLC_0_CCUCMAR_MNTOPACTV(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMAR_MNTOPACTV_SHIFT)) & CPE_LLC_0_CCUCMAR_MNTOPACTV_MASK)
/*! @} */

/*! @name CCUCMLR0 - Maintenance Location 0 */
/*! @{ */

#define CPE_LLC_0_CCUCMLR0_MNTSET_MASK           (0x7FFFU)
#define CPE_LLC_0_CCUCMLR0_MNTSET_SHIFT          (0U)
#define CPE_LLC_0_CCUCMLR0_MNTSET_WIDTH          (15U)
#define CPE_LLC_0_CCUCMLR0_MNTSET(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMLR0_MNTSET_SHIFT)) & CPE_LLC_0_CCUCMLR0_MNTSET_MASK)

#define CPE_LLC_0_CCUCMLR0_MNTWAY_MASK           (0x1F8000U)
#define CPE_LLC_0_CCUCMLR0_MNTWAY_SHIFT          (15U)
#define CPE_LLC_0_CCUCMLR0_MNTWAY_WIDTH          (6U)
#define CPE_LLC_0_CCUCMLR0_MNTWAY(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMLR0_MNTWAY_SHIFT)) & CPE_LLC_0_CCUCMLR0_MNTWAY_MASK)

#define CPE_LLC_0_CCUCMLR0_MNTWORD_MASK          (0xFFE00000U)
#define CPE_LLC_0_CCUCMLR0_MNTWORD_SHIFT         (21U)
#define CPE_LLC_0_CCUCMLR0_MNTWORD_WIDTH         (11U)
#define CPE_LLC_0_CCUCMLR0_MNTWORD(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMLR0_MNTWORD_SHIFT)) & CPE_LLC_0_CCUCMLR0_MNTWORD_MASK)
/*! @} */

/*! @name CCUCMLR1 - Maintenance Location 1 */
/*! @{ */

#define CPE_LLC_0_CCUCMLR1_MNTADDR_MASK          (0xFFFFU)
#define CPE_LLC_0_CCUCMLR1_MNTADDR_SHIFT         (0U)
#define CPE_LLC_0_CCUCMLR1_MNTADDR_WIDTH         (16U)
#define CPE_LLC_0_CCUCMLR1_MNTADDR(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMLR1_MNTADDR_SHIFT)) & CPE_LLC_0_CCUCMLR1_MNTADDR_MASK)
/*! @} */

/*! @name CCUCMLR2 - Maintenance Location 2 */
/*! @{ */

#define CPE_LLC_0_CCUCMLR2_MNTRANGE_MASK         (0xFFFFU)
#define CPE_LLC_0_CCUCMLR2_MNTRANGE_SHIFT        (0U)
#define CPE_LLC_0_CCUCMLR2_MNTRANGE_WIDTH        (16U)
#define CPE_LLC_0_CCUCMLR2_MNTRANGE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMLR2_MNTRANGE_SHIFT)) & CPE_LLC_0_CCUCMLR2_MNTRANGE_MASK)
/*! @} */

/*! @name CCUCMDR - Maintenance Data */
/*! @{ */

#define CPE_LLC_0_CCUCMDR_MNTDATA_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUCMDR_MNTDATA_SHIFT          (0U)
#define CPE_LLC_0_CCUCMDR_MNTDATA_WIDTH          (32U)
#define CPE_LLC_0_CCUCMDR_MNTDATA(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMDR_MNTDATA_SHIFT)) & CPE_LLC_0_CCUCMDR_MNTDATA_MASK)
/*! @} */

/*! @name CCUCMWVR - Maintenance Way Valid */
/*! @{ */

#define CPE_LLC_0_CCUCMWVR_WAYVALID_MASK         (0xFFFFU)
#define CPE_LLC_0_CCUCMWVR_WAYVALID_SHIFT        (0U)
#define CPE_LLC_0_CCUCMWVR_WAYVALID_WIDTH        (16U)
#define CPE_LLC_0_CCUCMWVR_WAYVALID(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCMWVR_WAYVALID_SHIFT)) & CPE_LLC_0_CCUCMWVR_WAYVALID_MASK)
/*! @} */

/*! @name CCUCECR - Correctable Error Control */
/*! @{ */

#define CPE_LLC_0_CCUCECR_ERRDETEN_MASK          (0x1U)
#define CPE_LLC_0_CCUCECR_ERRDETEN_SHIFT         (0U)
#define CPE_LLC_0_CCUCECR_ERRDETEN_WIDTH         (1U)
#define CPE_LLC_0_CCUCECR_ERRDETEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCECR_ERRDETEN_SHIFT)) & CPE_LLC_0_CCUCECR_ERRDETEN_MASK)

#define CPE_LLC_0_CCUCECR_ERRINTEN_MASK          (0x2U)
#define CPE_LLC_0_CCUCECR_ERRINTEN_SHIFT         (1U)
#define CPE_LLC_0_CCUCECR_ERRINTEN_WIDTH         (1U)
#define CPE_LLC_0_CCUCECR_ERRINTEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCECR_ERRINTEN_SHIFT)) & CPE_LLC_0_CCUCECR_ERRINTEN_MASK)

#define CPE_LLC_0_CCUCECR_ERRTHRESHOLD_MASK      (0xFF0U)
#define CPE_LLC_0_CCUCECR_ERRTHRESHOLD_SHIFT     (4U)
#define CPE_LLC_0_CCUCECR_ERRTHRESHOLD_WIDTH     (8U)
#define CPE_LLC_0_CCUCECR_ERRTHRESHOLD(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCECR_ERRTHRESHOLD_SHIFT)) & CPE_LLC_0_CCUCECR_ERRTHRESHOLD_MASK)
/*! @} */

/*! @name CCUCESR - Correctable Error Status */
/*! @{ */

#define CPE_LLC_0_CCUCESR_CERRVLD_MASK           (0x1U)
#define CPE_LLC_0_CCUCESR_CERRVLD_SHIFT          (0U)
#define CPE_LLC_0_CCUCESR_CERRVLD_WIDTH          (1U)
#define CPE_LLC_0_CCUCESR_CERRVLD(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCESR_CERRVLD_SHIFT)) & CPE_LLC_0_CCUCESR_CERRVLD_MASK)

#define CPE_LLC_0_CCUCESR_CERRCOUNTOVERFLOW_MASK (0x2U)
#define CPE_LLC_0_CCUCESR_CERRCOUNTOVERFLOW_SHIFT (1U)
#define CPE_LLC_0_CCUCESR_CERRCOUNTOVERFLOW_WIDTH (1U)
#define CPE_LLC_0_CCUCESR_CERRCOUNTOVERFLOW(x)   (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUCESR_CERRCOUNTOVERFLOW_SHIFT)) & CPE_LLC_0_CCUCESR_CERRCOUNTOVERFLOW_MASK)

