zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_0.h
#define CPE_LLC_0_CCUPMSC_DURATION_MASK          (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMSC_DURATION_SHIFT         (0U)
#define CPE_LLC_0_CCUPMSC_DURATION_WIDTH         (32U)
#define CPE_LLC_0_CCUPMSC_DURATION(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMSC_DURATION_SHIFT)) & CPE_LLC_0_CCUPMSC_DURATION_MASK)
/*! @} */

/*! @name CCUPMOTC - Performance Monitor OTT Threshold Configuration */
/*! @{ */

#define CPE_LLC_0_CCUPMOTC_RTT_MASK              (0x1FU)
#define CPE_LLC_0_CCUPMOTC_RTT_SHIFT             (0U)
#define CPE_LLC_0_CCUPMOTC_RTT_WIDTH             (5U)
#define CPE_LLC_0_CCUPMOTC_RTT(x)                (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMOTC_RTT_SHIFT)) & CPE_LLC_0_CCUPMOTC_RTT_MASK)

#define CPE_LLC_0_CCUPMOTC_WTT_MASK              (0x1F0000U)
#define CPE_LLC_0_CCUPMOTC_WTT_SHIFT             (16U)
#define CPE_LLC_0_CCUPMOTC_WTT_WIDTH             (5U)
#define CPE_LLC_0_CCUPMOTC_WTT(x)                (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMOTC_WTT_SHIFT)) & CPE_LLC_0_CCUPMOTC_WTT_MASK)
/*! @} */

/*! @name CCUPMCYCO - Performance Monitor Cycle Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMCYCO_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMCYCO_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMCYCO_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMCYCO_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMCYCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMCYCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMCYCA - Performance Monitor Cycle Counter Capture */
/*! @{ */

#define CPE_LLC_0_CCUPMCYCA_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMCYCA_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMCYCA_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMCYCA_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMCYCA_COUNT_SHIFT)) & CPE_LLC_0_CCUPMCYCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMRRCO - Performance Monitor Read Request Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMRRCO_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMRRCO_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMRRCO_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMRRCO_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMRRCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMRRCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMWRCO - Performance Monitor Write Request Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMWRCO_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMWRCO_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMWRCO_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMWRCO_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMWRCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMWRCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMCRRCO - Performance Monitor Cacheable Read Request Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMCRRCO_COUNT_MASK          (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMCRRCO_COUNT_SHIFT         (0U)
#define CPE_LLC_0_CCUPMCRRCO_COUNT_WIDTH         (32U)
#define CPE_LLC_0_CCUPMCRRCO_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMCRRCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMCRRCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMCWRCO - Performance Monitor Cacheable Write Request Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMCWRCO_COUNT_MASK          (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMCWRCO_COUNT_SHIFT         (0U)
#define CPE_LLC_0_CCUPMCWRCO_COUNT_WIDTH         (32U)
#define CPE_LLC_0_CCUPMCWRCO_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMCWRCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMCWRCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMRHCO - Performance Monitor Read Hit Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMRHCO_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMRHCO_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMRHCO_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMRHCO_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMRHCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMRHCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMWHCO - Performance Monitor Write Hit Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMWHCO_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMWHCO_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMWHCO_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMWHCO_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMWHCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMWHCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMECO - Performance Monitor Eviction Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMECO_COUNT_MASK            (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMECO_COUNT_SHIFT           (0U)
#define CPE_LLC_0_CCUPMECO_COUNT_WIDTH           (32U)
#define CPE_LLC_0_CCUPMECO_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMECO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMECO_COUNT_MASK)
/*! @} */

/*! @name CCUPMRBCO - Performance Monitor Read Beat Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMRBCO_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMRBCO_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMRBCO_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMRBCO_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMRBCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMRBCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMWBCO - Performance Monitor Write Beat Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMWBCO_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMWBCO_COUNT_SHIFT          (0U)
#define CPE_LLC_0_CCUPMWBCO_COUNT_WIDTH          (32U)
#define CPE_LLC_0_CCUPMWBCO_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMWBCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMWBCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMRATCO - Performance Monitor RTT Above Threshold Counter */
/*! @{ */

#define CPE_LLC_0_CCUPMRATCO_COUNT_MASK          (0xFFFFFFFFU)
#define CPE_LLC_0_CCUPMRATCO_COUNT_SHIFT         (0U)
#define CPE_LLC_0_CCUPMRATCO_COUNT_WIDTH         (32U)
#define CPE_LLC_0_CCUPMRATCO_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_0_CCUPMRATCO_COUNT_SHIFT)) & CPE_LLC_0_CCUPMRATCO_COUNT_MASK)
/*! @} */

/*! @name CCUPMWATCO - Performance Monitor WTT Above Threshold Counter */
/*! @{ */

